In [1]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

#Loading data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

#data cleaning
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [2]:
df.head()

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,None,NaN,NaN,Boehringer Ingelheim,None,None
1,Data Analyst,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee México,Full-time,False,Mexico,2023-01-14 13:18:07,False,False,Mexico,None,NaN,NaN,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."
2,Data Engineer,"Data Engineer/Scientist/Analyst, Mid or Senior...","Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-10 13:14:55,False,False,Germany,None,NaN,NaN,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."
3,Data Engineer,LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,None,NaN,NaN,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
4,Data Engineer,Data Engineer- Sr Jobs,"Washington, DC",via Clearance Jobs,Full-time,False,Sudan,2023-08-07 14:29:36,False,False,Sudan,None,NaN,NaN,Kristina Daniel,"['bash', 'python', 'oracle', 'aws', 'ansible',...","{'cloud': ['oracle', 'aws'], 'other': ['ansibl..."

In [3]:
df.tail()

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
785736,Software Engineer,DevOps Engineer,Singapura,melalui Trabajo.org,Pekerjaan tetap,False,Singapore,2023-03-13 06:16:16,False,False,Singapore,None,NaN,NaN,CAREERSTAR INTERNATIONAL PTE. LTD.,"['bash', 'python', 'perl', 'linux', 'unix', 'k...","{'os': ['linux', 'unix'], 'other': ['kubernete..."
785737,Data Analyst,CRM Data Analyst,"Bad Rodach, Jerman",melalui BeBee Deutschland,Pekerjaan tetap,False,Germany,2023-03-12 06:18:18,False,False,Germany,None,NaN,NaN,HABA FAMILYGROUP,"['sas', 'sas', 'sql', 'excel']","{'analyst_tools': ['sas', 'excel'], 'programmi..."
785738,Business Analyst,Commercial Analyst - Start Now,Malaysia,melalui Ricebowl,Pekerjaan tetap,False,Malaysia,2023-03-12 06:32:36,False,False,Malaysia,None,NaN,NaN,Lendlease Corporation,"['powerpoint', 'excel']","{'analyst_tools': ['powerpoint', 'excel']}"
785739,Data Engineer,"Principal Associate, Data Engineer (Remote-Eli...","Newark, New Jersey, Amerika Serikat",melalui Recruit.net,Pekerjaan tetap,False,Sudan,2023-03-12 06:32:15,False,False,Sudan,None,NaN,NaN,Capital One,"['python', 'go', 'nosql', 'sql', 'mongo', 'she...","{'cloud': ['aws', 'snowflake', 'azure', 'redsh..."
785740,Software Engineer,AWS System Analyst,India,melalui Trigyn,Pekerjaan tetap,False,India,2023-03-13 06:16:31,False,False,India,None,NaN,NaN,Trigyn,"['aws', 'flow']","{'cloud': ['aws'], 'other': ['flow']}"

# Sample()

In [10]:
df.sample(10, random_state=42)

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
502901,Senior Data Engineer,Senior Data Engineer,"St Paul, MN",via BeBee,Full-time,False,"Florida, United States",2023-12-17 11:09:06,False,False,United States,None,NaN,NaN,ManpowerGroup,"['sql', 'azure', 'git']","{'cloud': ['azure'], 'other': ['git'], 'progra..."
406337,Senior Data Scientist,Senior Analytics Engineer,"London, UK",via LinkedIn,Full-time,False,United Kingdom,2023-10-06 16:09:56,False,False,United Kingdom,None,NaN,NaN,Harnham,"['sql', 'python', 'bigquery', 'snowflake', 'lo...","{'analyst_tools': ['looker'], 'cloud': ['bigqu..."
659951,Data Engineer,Data Engineer,"Newcastle upon Tyne, UK",via Indeed,Full-time,False,United Kingdom,2023-09-06 10:11:25,True,False,United Kingdom,None,NaN,NaN,Morgan King,None,None
541593,Data Analyst,Data Analyst,Malta,via Trabajo.org,Full-time,False,Malta,2023-02-14 21:14:18,True,False,Malta,None,NaN,NaN,Konnekt,['jira'],{'async': ['jira']}
425158,Senior Data Engineer,Senior Data Engineer. Job in Amsterdam NBC4i Jobs,"Amsterdam, Netherlands",via NBC4i Jobs,Full-time,False,Netherlands,2023-06-19 16:34:30,True,False,Netherlands,None,NaN,NaN,Independent Recruiters,['python'],{'programming': ['python']}
183426,Data Analyst,Data Analyst,Singapore,via Singapore | JobsDB,Full-time,False,Singapore,2023-11-09 16:07:57,False,False,Singapore,None,NaN,NaN,FLEXOSENSE PTE. LTD.,"['r', 'python', 'java', 'sql', 'sql server', '...","{'analyst_tools': ['tableau'], 'cloud': ['orac..."
287790,Data Analyst,Data Analyst,"Tampa, FL",via LinkedIn,Full-time,False,"Florida, United States",2023-07-14 17:02:23,True,False,United States,None,NaN,NaN,Iris Software Inc.,"['sql', 'hadoop', 'excel']","{'analyst_tools': ['excel'], 'libraries': ['ha..."
541983,Data Analyst,"Data Analyst, Cloud Systems Jobs","Chantilly, VA",via Clearance Jobs,Full-time,False,Georgia,2023-06-15 19:44:34,False,False,United States,None,NaN,NaN,SAIC,"['sql', 'r', 'matlab', 'python', 'oracle', 'aw...","{'analyst_tools': ['power bi', 'tableau', 'qli..."
416896,Data Scientist,Alternant Actuariat & Data Science H/F,France,via LinkedIn,Full-time,False,France,2023-09-22 16:47:24,False,False,France,None,NaN,NaN,KPMG France,None,None
780907,Data Engineer,"Data Engineer with Fivetran,Qlik Must","Mexico City, CDMX, Mexico",via BeBee México,Full-time,False,Mexico,2023-01-16 06:19:09,False,False,Mexico,None,NaN,NaN,CORUS Consulting,"['oracle', 'snowflake', 'aws', 'azure', 'alter...","{'analyst_tools': ['alteryx'], 'cloud': ['orac..."

# Copy()

In [11]:
df_original= df

In [29]:
df_altered = df_original
id(df_original), id(df_original)#use copy, otherwise making changes in df_altered alter the df_original

(6004146576, 6004146576)

In [55]:
df_altered = df_original.copy()

# hw

In [56]:
df_altered

,job_title_short,job_title,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,Senior Data Engineer,Senior Clinical Data Engineer / Principal Clin...,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,None,NaN,NaN,Boehringer Ingelheim,None,None
1,Data Analyst,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee México,Full-time,False,Mexico,2023-01-14 13:18:07,False,False,Mexico,None,NaN,NaN,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."
2,Data Engineer,"Data Engineer/Scientist/Analyst, Mid or Senior...","Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-10 13:14:55,False,False,Germany,None,NaN,NaN,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."
3,Data Engineer,LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ...,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,None,NaN,NaN,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
4,Data Engineer,Data Engineer- Sr Jobs,"Washington, DC",via Clearance Jobs,Full-time,False,Sudan,2023-08-07 14:29:36,False,False,Sudan,None,NaN,NaN,Kristina Daniel,"['bash', 'python', 'oracle', 'aws', 'ansible',...","{'cloud': ['oracle', 'aws'], 'other': ['ansibl..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
785736,Software Engineer,DevOps Engineer,Singapura,melalui Trabajo.org,Pekerjaan tetap,False,Singapore,2023-03-13 06:16:16,False,False,Singapore,None,NaN,NaN,CAREERSTAR INTERNATIONAL PTE. LTD.,"['bash', 'python', 'perl', 'linux', 'unix', 'k...","{'os': ['linux', 'unix'], 'other': ['kubernete..."
785737,Data Analyst,CRM Data Analyst,"Bad Rodach, Jerman",melalui BeBee Deutschland,Pekerjaan tetap,False,Germany,2023-03-12 06:18:18,False,False,Germany,None,NaN,NaN,HABA FAMILYGROUP,"['sas', 'sas', 'sql', 'excel']","{'analyst_tools': ['sas', 'excel'], 'programmi..."
785738,Business Analyst,Commercial Analyst - Start Now,Malaysia,melalui Ricebowl,Pekerjaan tetap,False,Malaysia,2023-03-12 06:32:36,False,False,Malaysia,None,NaN,NaN,Lendlease Corporation,"['powerpoint', 'excel']","{'analyst_tools': ['powerpoint', 'excel']}"
785739,Data Engineer,"Principal Associate, Data Engineer (Remote-Eli...","Newark, New Jersey, Amerika Serikat",melalui Recruit.net,Pekerjaan tetap,False,Sudan,2023-03-12 06:32:15,False,False,Sudan,None,NaN,NaN,Capital One,"['python', 'go', 'nosql', 'sql', 'mongo', 'she...","{'cloud': ['aws', 'snowflake', 'azure', 'redsh..."
785740,Software Engineer,AWS System Analyst,India,melalui Trigyn,Pekerjaan tetap,False,India,2023-03-13 06:16:31,False,False,India,None,NaN,NaN,Trigyn,"['aws', 'flow']","{'cloud': ['aws'], 'other': ['flow']}"

In [57]:
median_year_salary = df_altered['salary_year_avg'].median()
median_hour_salary = df_altered['salary_hour_avg'].median()
df_altered['salary_year_avg'] = df_altered['salary_year_avg'].fillna(median_year_salary)
df_altered['salary_hour_avg'] = df_altered['salary_hour_avg'].fillna(median_hour_salary)

# 🟩 Set Index and Display Rows (2.5.1)

In [58]:
df_altered = df_altered.set_index('job_title')
df_altered.iloc[0:7, 0:6]

,job_title_short,job_location,job_via,job_schedule_type,job_work_from_home,search_location
job_title,,,,,,
Senior Clinical Data Engineer / Principal Clinical Data Engineer ...,Senior Data Engineer,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States"
Data Analyst,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee México,Full-time,False,Mexico
"Data Engineer/Scientist/Analyst, Mid or Senior (m/f/x)",Data Engineer,"Berlin, Germany",via LinkedIn,Full-time,False,Germany
LEAD ENGINEER - PRINCIPAL ANALYST - PRINCIPAL ENGINEER - DATA...,Data Engineer,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States"
Data Engineer- Sr Jobs,Data Engineer,"Washington, DC",via Clearance Jobs,Full-time,False,Sudan
GCP Data Engineer,Data Engineer,Anywhere,via ZipRecruiter,Contractor and Temp work,True,Georgia
Senior Data Engineer - GCP Cloud,Senior Data Engineer,"Dearborn, MI",via LinkedIn,Full-time,False,"Florida, United States"

# 🟩 Reset Index and Drop Existing (2.5.2)

In [59]:
df_altered  = df_altered.reset_index(drop=True)#drop=true removes the old index column completely i.e job_tiltle column
df_altered

,job_title_short,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,Senior Data Engineer,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,None,115000.0,45.98,Boehringer Ingelheim,None,None
1,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee México,Full-time,False,Mexico,2023-01-14 13:18:07,False,False,Mexico,None,115000.0,45.98,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."
2,Data Engineer,"Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-10 13:14:55,False,False,Germany,None,115000.0,45.98,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."
3,Data Engineer,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,None,115000.0,45.98,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
4,Data Engineer,"Washington, DC",via Clearance Jobs,Full-time,False,Sudan,2023-08-07 14:29:36,False,False,Sudan,None,115000.0,45.98,Kristina Daniel,"['bash', 'python', 'oracle', 'aws', 'ansible',...","{'cloud': ['oracle', 'aws'], 'other': ['ansibl..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
785736,Software Engineer,Singapura,melalui Trabajo.org,Pekerjaan tetap,False,Singapore,2023-03-13 06:16:16,False,False,Singapore,None,115000.0,45.98,CAREERSTAR INTERNATIONAL PTE. LTD.,"['bash', 'python', 'perl', 'linux', 'unix', 'k...","{'os': ['linux', 'unix'], 'other': ['kubernete..."
785737,Data Analyst,"Bad Rodach, Jerman",melalui BeBee Deutschland,Pekerjaan tetap,False,Germany,2023-03-12 06:18:18,False,False,Germany,None,115000.0,45.98,HABA FAMILYGROUP,"['sas', 'sas', 'sql', 'excel']","{'analyst_tools': ['sas', 'excel'], 'programmi..."
785738,Business Analyst,Malaysia,melalui Ricebowl,Pekerjaan tetap,False,Malaysia,2023-03-12 06:32:36,False,False,Malaysia,None,115000.0,45.98,Lendlease Corporation,"['powerpoint', 'excel']","{'analyst_tools': ['powerpoint', 'excel']}"
785739,Data Engineer,"Newark, New Jersey, Amerika Serikat",melalui Recruit.net,Pekerjaan tetap,False,Sudan,2023-03-12 06:32:15,False,False,Sudan,None,115000.0,45.98,Capital One,"['python', 'go', 'nosql', 'sql', 'mongo', 'she...","{'cloud': ['aws', 'snowflake', 'azure', 'redsh..."
785740,Software Engineer,India,melalui Trigyn,Pekerjaan tetap,False,India,2023-03-13 06:16:31,False,False,India,None,115000.0,45.98,Trigyn,"['aws', 'flow']","{'cloud': ['aws'], 'other': ['flow']}"

# 🟩 Sort Index (2.5.3)

In [63]:
#df_altered.sort_index(ascending=False, inplace=True)
df_altered.sort_index(inplace=True)
df_altered

,job_title_short,job_location,job_via,job_schedule_type,job_work_from_home,search_location,job_posted_date,job_no_degree_mention,job_health_insurance,job_country,salary_rate,salary_year_avg,salary_hour_avg,company_name,job_skills,job_type_skills
0,Senior Data Engineer,"Watertown, CT",via Work Nearby,Full-time,False,"Texas, United States",2023-06-16 13:44:15,False,False,United States,None,115000.0,45.98,Boehringer Ingelheim,None,None
1,Data Analyst,"Guadalajara, Jalisco, Mexico",via BeBee México,Full-time,False,Mexico,2023-01-14 13:18:07,False,False,Mexico,None,115000.0,45.98,Hewlett Packard Enterprise,"['r', 'python', 'sql', 'nosql', 'power bi', 't...","{'analyst_tools': ['power bi', 'tableau'], 'pr..."
2,Data Engineer,"Berlin, Germany",via LinkedIn,Full-time,False,Germany,2023-10-10 13:14:55,False,False,Germany,None,115000.0,45.98,ALPHA Augmented Services,"['python', 'sql', 'c#', 'azure', 'airflow', 'd...","{'analyst_tools': ['dax'], 'cloud': ['azure'],..."
3,Data Engineer,"San Antonio, TX",via Diversity.com,Full-time,False,"Texas, United States",2023-07-04 13:01:41,True,False,United States,None,115000.0,45.98,Southwest Research Institute,"['python', 'c++', 'java', 'matlab', 'aws', 'te...","{'cloud': ['aws'], 'libraries': ['tensorflow',..."
4,Data Engineer,"Washington, DC",via Clearance Jobs,Full-time,False,Sudan,2023-08-07 14:29:36,False,False,Sudan,None,115000.0,45.98,Kristina Daniel,"['bash', 'python', 'oracle', 'aws', 'ansible',...","{'cloud': ['oracle', 'aws'], 'other': ['ansibl..."
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
785736,Software Engineer,Singapura,melalui Trabajo.org,Pekerjaan tetap,False,Singapore,2023-03-13 06:16:16,False,False,Singapore,None,115000.0,45.98,CAREERSTAR INTERNATIONAL PTE. LTD.,"['bash', 'python', 'perl', 'linux', 'unix', 'k...","{'os': ['linux', 'unix'], 'other': ['kubernete..."
785737,Data Analyst,"Bad Rodach, Jerman",melalui BeBee Deutschland,Pekerjaan tetap,False,Germany,2023-03-12 06:18:18,False,False,Germany,None,115000.0,45.98,HABA FAMILYGROUP,"['sas', 'sas', 'sql', 'excel']","{'analyst_tools': ['sas', 'excel'], 'programmi..."
785738,Business Analyst,Malaysia,melalui Ricebowl,Pekerjaan tetap,False,Malaysia,2023-03-12 06:32:36,False,False,Malaysia,None,115000.0,45.98,Lendlease Corporation,"['powerpoint', 'excel']","{'analyst_tools': ['powerpoint', 'excel']}"
785739,Data Engineer,"Newark, New Jersey, Amerika Serikat",melalui Recruit.net,Pekerjaan tetap,False,Sudan,2023-03-12 06:32:15,False,False,Sudan,None,115000.0,45.98,Capital One,"['python', 'go', 'nosql', 'sql', 'mongo', 'she...","{'cloud': ['aws', 'snowflake', 'azure', 'redsh..."
785740,Software Engineer,India,melalui Trigyn,Pekerjaan tetap,False,India,2023-03-13 06:16:31,False,False,India,None,115000.0,45.98,Trigyn,"['aws', 'flow']","{'cloud': ['aws'], 'other': ['flow']}"

# 🟨 Pivot Table Reset & Set Index (2.5.4)

In [75]:
pivot = df_altered.pivot_table(index='job_title_short', columns='job_country', values='salary_year_avg', aggfunc='mean')
pivot

job_country,Afghanistan,Albania,Algeria,Angola,Argentina,Armenia,Australia,Austria,Azerbaijan,Bahamas,...,United Arab Emirates,United Kingdom,United States,Uruguay,Uzbekistan,Venezuela,Vietnam,Yemen,Zambia,Zimbabwe
job_title_short,,,,,,,,,,,,,,,,,,,,,
Business Analyst,115000.0,115000.000000,115000.000000,115000.0,114806.181015,115000.000000,114911.637931,115000.000000,115000.000000,115000.000000,...,115000.000000,114604.353083,113900.923575,115000.000000,115000.0,115000.0,113661.538462,115000.0,115000.000000,115000.000000
Cloud Engineer,NaN,115000.000000,115000.000000,NaN,115256.211180,115000.000000,114989.775051,115000.000000,NaN,115000.000000,...,115000.000000,115000.000000,115240.704492,115000.000000,115000.0,115000.0,115000.000000,NaN,115000.000000,115000.000000
Data Analyst,115000.0,111386.111111,111777.272727,115000.0,114907.105656,114121.212121,114970.747889,114962.423237,115000.000000,115000.000000,...,114955.305373,114824.230681,113688.506362,114936.123348,115000.0,115000.0,114204.392216,115000.0,115000.000000,113470.588235
Data Engineer,NaN,115000.000000,111666.666667,115000.0,114881.059161,112055.555556,114983.769751,115027.586207,115000.000000,174660.285714,...,115055.305092,115003.161853,116597.655722,115000.000000,115000.0,115000.0,114656.420573,115000.0,115000.000000,115000.000000
Data Scientist,115000.0,107496.875000,115000.000000,115000.0,114942.623067,115000.000000,115146.981340,114948.800176,115000.000000,115000.000000,...,115037.808456,114961.064714,116930.687709,115000.000000,113315.0,115000.0,114585.066667,NaN,113128.461538,107936.153846
Machine Learning Engineer,NaN,115000.000000,115000.000000,NaN,115167.348432,112456.454545,115142.025000,114830.163934,115000.000000,190833.333333,...,114364.024390,115542.432177,120453.603692,113586.956522,115000.0,115000.0,111965.652174,NaN,115000.000000,115000.000000
Senior Data Analyst,115000.0,115000.000000,NaN,NaN,115000.000000,115000.000000,114584.774194,114827.906977,115000.000000,115000.000000,...,114852.480916,114954.657080,115056.457947,115000.000000,115000.0,115000.0,114183.802817,NaN,115000.000000,115000.000000
Senior Data Engineer,NaN,115000.000000,115000.000000,NaN,115100.463679,115000.000000,115029.720648,115132.103321,115000.000000,155208.333333,...,115000.000000,115162.181750,119151.362744,115000.000000,115000.0,115000.0,115220.454545,NaN,NaN,115000.000000
Senior Data Scientist,NaN,118863.636364,NaN,115000.0,115000.000000,115000.000000,115703.642384,114924.279379,115000.000000,115000.000000,...,114473.469388,115188.583016,119249.503024,113935.185185,115000.0,115000.0,114606.593407,NaN,115000.000000,115000.000000
Software Engineer,NaN,115000.000000,115000.000000,115000.0,115046.961326,115000.000000,115096.875393,115000.000000,111928.571429,129289.473684,...,114925.416667,114891.682070,116987.593134,115000.000000,115000.0,115000.0,114559.856631,115000.0,115000.000000,115000.000000

In [76]:
pivot.reset_index(inplace=True)
pivot

job_country,job_title_short,Afghanistan,Albania,Algeria,Angola,Argentina,Armenia,Australia,Austria,Azerbaijan,...,United Arab Emirates,United Kingdom,United States,Uruguay,Uzbekistan,Venezuela,Vietnam,Yemen,Zambia,Zimbabwe
0,Business Analyst,115000.0,115000.000000,115000.000000,115000.0,114806.181015,115000.000000,114911.637931,115000.000000,115000.000000,...,115000.000000,114604.353083,113900.923575,115000.000000,115000.0,115000.0,113661.538462,115000.0,115000.000000,115000.000000
1,Cloud Engineer,NaN,115000.000000,115000.000000,NaN,115256.211180,115000.000000,114989.775051,115000.000000,NaN,...,115000.000000,115000.000000,115240.704492,115000.000000,115000.0,115000.0,115000.000000,NaN,115000.000000,115000.000000
2,Data Analyst,115000.0,111386.111111,111777.272727,115000.0,114907.105656,114121.212121,114970.747889,114962.423237,115000.000000,...,114955.305373,114824.230681,113688.506362,114936.123348,115000.0,115000.0,114204.392216,115000.0,115000.000000,113470.588235
3,Data Engineer,NaN,115000.000000,111666.666667,115000.0,114881.059161,112055.555556,114983.769751,115027.586207,115000.000000,...,115055.305092,115003.161853,116597.655722,115000.000000,115000.0,115000.0,114656.420573,115000.0,115000.000000,115000.000000
4,Data Scientist,115000.0,107496.875000,115000.000000,115000.0,114942.623067,115000.000000,115146.981340,114948.800176,115000.000000,...,115037.808456,114961.064714,116930.687709,115000.000000,113315.0,115000.0,114585.066667,NaN,113128.461538,107936.153846
5,Machine Learning Engineer,NaN,115000.000000,115000.000000,NaN,115167.348432,112456.454545,115142.025000,114830.163934,115000.000000,...,114364.024390,115542.432177,120453.603692,113586.956522,115000.0,115000.0,111965.652174,NaN,115000.000000,115000.000000
6,Senior Data Analyst,115000.0,115000.000000,NaN,NaN,115000.000000,115000.000000,114584.774194,114827.906977,115000.000000,...,114852.480916,114954.657080,115056.457947,115000.000000,115000.0,115000.0,114183.802817,NaN,115000.000000,115000.000000
7,Senior Data Engineer,NaN,115000.000000,115000.000000,NaN,115100.463679,115000.000000,115029.720648,115132.103321,115000.000000,...,115000.000000,115162.181750,119151.362744,115000.000000,115000.0,115000.0,115220.454545,NaN,NaN,115000.000000
8,Senior Data Scientist,NaN,118863.636364,NaN,115000.0,115000.000000,115000.000000,115703.642384,114924.279379,115000.000000,...,114473.469388,115188.583016,119249.503024,113935.185185,115000.0,115000.0,114606.593407,NaN,115000.000000,115000.000000
9,Software Engineer,NaN,115000.000000,115000.000000,115000.0,115046.961326,115000.000000,115096.875393,115000.000000,111928.571429,...,114925.416667,114891.682070,116987.593134,115000.000000,115000.0,115000.0,114559.856631,115000.0,115000.000000,115000.000000

In [74]:
pivot  = pivot.set_index('job_title_short')
pivot

job_country,Afghanistan,Albania,Algeria,Angola,Argentina,Armenia,Australia,Austria,Azerbaijan,Bahamas,...,United Arab Emirates,United Kingdom,United States,Uruguay,Uzbekistan,Venezuela,Vietnam,Yemen,Zambia,Zimbabwe
job_title_short,,,,,,,,,,,,,,,,,,,,,
Business Analyst,115000.0,115000.000000,115000.000000,115000.0,114806.181015,115000.000000,114911.637931,115000.000000,115000.000000,115000.000000,...,115000.000000,114604.353083,113900.923575,115000.000000,115000.0,115000.0,113661.538462,115000.0,115000.000000,115000.000000
Cloud Engineer,NaN,115000.000000,115000.000000,NaN,115256.211180,115000.000000,114989.775051,115000.000000,NaN,115000.000000,...,115000.000000,115000.000000,115240.704492,115000.000000,115000.0,115000.0,115000.000000,NaN,115000.000000,115000.000000
Data Analyst,115000.0,111386.111111,111777.272727,115000.0,114907.105656,114121.212121,114970.747889,114962.423237,115000.000000,115000.000000,...,114955.305373,114824.230681,113688.506362,114936.123348,115000.0,115000.0,114204.392216,115000.0,115000.000000,113470.588235
Data Engineer,NaN,115000.000000,111666.666667,115000.0,114881.059161,112055.555556,114983.769751,115027.586207,115000.000000,174660.285714,...,115055.305092,115003.161853,116597.655722,115000.000000,115000.0,115000.0,114656.420573,115000.0,115000.000000,115000.000000
Data Scientist,115000.0,107496.875000,115000.000000,115000.0,114942.623067,115000.000000,115146.981340,114948.800176,115000.000000,115000.000000,...,115037.808456,114961.064714,116930.687709,115000.000000,113315.0,115000.0,114585.066667,NaN,113128.461538,107936.153846
Machine Learning Engineer,NaN,115000.000000,115000.000000,NaN,115167.348432,112456.454545,115142.025000,114830.163934,115000.000000,190833.333333,...,114364.024390,115542.432177,120453.603692,113586.956522,115000.0,115000.0,111965.652174,NaN,115000.000000,115000.000000
Senior Data Analyst,115000.0,115000.000000,NaN,NaN,115000.000000,115000.000000,114584.774194,114827.906977,115000.000000,115000.000000,...,114852.480916,114954.657080,115056.457947,115000.000000,115000.0,115000.0,114183.802817,NaN,115000.000000,115000.000000
Senior Data Engineer,NaN,115000.000000,115000.000000,NaN,115100.463679,115000.000000,115029.720648,115132.103321,115000.000000,155208.333333,...,115000.000000,115162.181750,119151.362744,115000.000000,115000.0,115000.0,115220.454545,NaN,NaN,115000.000000
Senior Data Scientist,NaN,118863.636364,NaN,115000.0,115000.000000,115000.000000,115703.642384,114924.279379,115000.000000,115000.000000,...,114473.469388,115188.583016,119249.503024,113935.185185,115000.0,115000.0,114606.593407,NaN,115000.000000,115000.000000
Software Engineer,NaN,115000.000000,115000.000000,115000.0,115046.961326,115000.000000,115096.875393,115000.000000,111928.571429,129289.473684,...,114925.416667,114891.682070,116987.593134,115000.000000,115000.0,115000.0,114559.856631,115000.0,115000.000000,115000.000000